// 2. Стандартный вывод 
// Задание 1. Знакомство со спецификаторами 

#include <stdio.h> 
#include <locale.h> 

void task_1()

{

	// 1.1 
	printf("123\n");
	printf("\n");
	// 1.2 
	printf("1\n2\n3\n");
	printf("\n");
	// 1.3 
	printf("1\n\t2\n\t\t3\n\t");
	printf("\n");
	// 1.4 * 
	printf("%i\n%2i\n%3i\n%4i", 1, 2, 3, 4);
	printf("\n\n");
	// 1.5 
	printf("%10.3f\n ", 12.234657);
	printf("\n");
	// 1.6 
	printf("%10.5f\n ", 12.234657);
	printf("\n");
	// 1.7 
	setlocale(LC_ALL, "RUS"); // для переключения русской кодировки  
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	printf("\n");
	// 1.8 
	printf("Результат деления %d на %d равно %d\n ", 7, 5, 7 / 5);
	printf("\n");
	printf("Результат умножения %d на %d равно %d\n ", 2000, 4, 2000 * 4);
	printf("\n");
	// 1.9 
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("\n");
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("\n");
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("\n");
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("\n");
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);
	printf("\n");

}

// Задание 2.  Напишите программу вывода числовых значений "времени" 

void task_2()

{
	// 2.1 
	int N, K;
	N = 10; // Часы  
	K = 30; // Минуты 
	// 2.2 
	printf("Сейчас %d часов %d минут 00 секунд", N, K);
	printf("\n");
	printf("Идет %d минута суток", N * 60 + K);
	printf("\n");
	printf("До полуночи осталось %d часов и %d минут", 23 - N, 60 - K);
	printf("\n");
	printf("С 8.00 прошло %d секунд", (((N - 8) * 60) + K) * 60);
	printf("\n");
	printf("Текущий час  = %5.2f / суток  и текущая минута = %5.2f / часа", N / 24., K / 60.);
	printf("\n");

}

// Задание 3. Напишите программу деления числа n  на L  с использованием одной функции printf 
// и выведите результат в формате k цифр целой части и m – дробной.  
void task_3()

{
	int l = 433, n = 4, k = 3, m = 1;

	printf("Дано:\n%16d\n%16d\n%18s\nОтвет:\n%*s%+0*.*f\n",
		n, l, "__________", 8, "", k + m + 2, m, (float)n / (float)l);

}

int main()

{
	setlocale(LC_ALL, "RUS");
	task_3();

}